# Cycle time

Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082
        
Write a query to return the average cycle time across each month. Cycle time is the time elapsed between one user joining and their invitees joining. Users who joined without an invitation have a zero in the “invited by” column.

In [1]:
%run Question.ipynb

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
8 rows affected.
8 rows affected.

In [2]:
%%sql

SELECT * FROM users

 * postgresql://fknight:***@localhost/postgres
8 rows affected.

[(1, datetime.date(2020, 1, 1), 0),
 (2, datetime.date(2020, 1, 10), 1),
 (3, datetime.date(2020, 2, 5), 2),
 (4, datetime.date(2020, 2, 12), 3),
 (5, datetime.date(2020, 2, 25), 2),
 (6, datetime.date(2020, 3, 1), 0),
 (7, datetime.date(2020, 3, 1), 4),
 (8, datetime.date(2020, 3, 4), 7)]

# Part A

Write a query that shows the invited user ID & join date alongside the inviter user ID & join date.

## Example answer

In [3]:
%%sql

SELECT 
    u1.id AS invited_id,
    u1.join_date AS invited_join_date,
    u2.id AS inviter_id,
    u2.join_date AS inviter_join_date
FROM users u1
JOIN users u2
ON u1.invited_by = u2.id
ORDER BY 1

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[(2, datetime.date(2020, 1, 10), 1, datetime.date(2020, 1, 1)),
 (3, datetime.date(2020, 2, 5), 2, datetime.date(2020, 1, 10)),
 (4, datetime.date(2020, 2, 12), 3, datetime.date(2020, 2, 5)),
 (5, datetime.date(2020, 2, 25), 2, datetime.date(2020, 1, 10)),
 (7, datetime.date(2020, 3, 1), 4, datetime.date(2020, 2, 12)),
 (8, datetime.date(2020, 3, 4), 7, datetime.date(2020, 3, 1))]

# Part B

Use the subquery from Part A to determine the cycle time for each inviter / invitee pair.

```sql
SELECT 
    u1.id AS invited_id,
    u1.join_date AS invited_join_date,
    u2.id AS inviter_id,
    u2.join_date AS inviter_join_date
FROM users u1
JOIN users u2
ON u1.invited_by = u2.id
ORDER BY 1
```

## Example answer

In [15]:
%%sql

WITH join_dates AS (
    SELECT
        u1.id AS invited_id,
        u1.join_date AS invited_join_date,
        u2.id AS inviter_id,
        u2.join_date AS inviter_join_date
    FROM users u1
    JOIN users u2
    ON u1.invited_by = u2.id
    ORDER BY 1
)

SELECT
    *,
    invited_join_date - inviter_join_date AS cycle_time
FROM join_dates

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[(2, datetime.date(2020, 1, 10), 1, datetime.date(2020, 1, 1), 9),
 (3, datetime.date(2020, 2, 5), 2, datetime.date(2020, 1, 10), 26),
 (4, datetime.date(2020, 2, 12), 3, datetime.date(2020, 2, 5), 7),
 (5, datetime.date(2020, 2, 25), 2, datetime.date(2020, 1, 10), 46),
 (7, datetime.date(2020, 3, 1), 4, datetime.date(2020, 2, 12), 18),
 (8, datetime.date(2020, 3, 4), 7, datetime.date(2020, 3, 1), 3)]

# Part C

Use the subquery from Part B to group each pair of users by the month that the invited user joined.

```sql
WITH join_dates AS (
    SELECT
        u1.id AS invited_id,
        u1.join_date AS invited_join_date,
        u2.id AS inviter_id,
        u2.join_date AS inviter_join_date
    FROM users u1
    JOIN users u2
    ON u1.invited_by = u2.id
    ORDER BY 1
),

cycle_times AS (    
    SELECT
        *,
        invited_join_date - inviter_join_date AS cycle_time
    FROM join_dates
)
```

## Example answer

In [22]:
%%sql

WITH join_dates AS (
    SELECT
        u1.id AS invited_id,
        u1.join_date AS invited_join_date,
        u2.id AS inviter_id,
        u2.join_date AS inviter_join_date
    FROM users u1
    JOIN users u2
    ON u1.invited_by = u2.id
    ORDER BY 1
),

cycle_times AS (    
    SELECT
        *,
        invited_join_date - inviter_join_date AS cycle_time
    FROM join_dates
)

SELECT 
    *, 
    EXTRACT(month FROM inviter_join_date) AS month
FROM cycle_times

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[(2, datetime.date(2020, 1, 10), 1, datetime.date(2020, 1, 1), 9, Decimal('1')),
 (3, datetime.date(2020, 2, 5), 2, datetime.date(2020, 1, 10), 26, Decimal('1')),
 (4, datetime.date(2020, 2, 12), 3, datetime.date(2020, 2, 5), 7, Decimal('2')),
 (5, datetime.date(2020, 2, 25), 2, datetime.date(2020, 1, 10), 46, Decimal('1')),
 (7, datetime.date(2020, 3, 1), 4, datetime.date(2020, 2, 12), 18, Decimal('2')),
 (8, datetime.date(2020, 3, 4), 7, datetime.date(2020, 3, 1), 3, Decimal('3'))]

# Part D

Using the subqueries from Parts A, B, & C, solve the original problem.

```sql
WITH join_dates AS (
    SELECT
        u1.id AS invited_id,
        u1.join_date AS invited_join_date,
        u2.id AS inviter_id,
        u2.join_date AS inviter_join_date
    FROM users u1
    JOIN users u2
    ON u1.invited_by = u2.id
    ORDER BY 1
),

cycle_times AS (    
    SELECT
        *,
        invited_join_date - inviter_join_date AS cycle_time
    FROM join_dates
),

cycle_months AS (
    SELECT 
        *, 
        EXTRACT(month FROM inviter_join_date) AS month
    FROM cycle_times
)
```

## Example answer

In [23]:
%%sql

WITH join_dates AS (
    SELECT
        u1.id AS invited_id,
        u1.join_date AS invited_join_date,
        u2.id AS inviter_id,
        u2.join_date AS inviter_join_date
    FROM users u1
    JOIN users u2
    ON u1.invited_by = u2.id
    ORDER BY 1
),

cycle_times AS (    
    SELECT
        *,
        invited_join_date - inviter_join_date AS cycle_time
    FROM join_dates
),

cycle_months AS (
    SELECT 
        *, 
        EXTRACT(month FROM inviter_join_date) AS month
    FROM cycle_times
)

SELECT month, 
    CAST(avg(cycle_time) AS float) AS avg_cycle_time 
FROM cycle_months
GROUP BY 1
ORDER BY 1

 * postgresql://fknight:***@localhost/postgres
3 rows affected.

[(Decimal('1'), 27.0), (Decimal('2'), 12.5), (Decimal('3'), 3.0)]

## The full solution is given below

In [24]:
%%sql

WITH join_dates AS (
    SELECT
        u1.id AS invited_id,
        u1.join_date AS invited_join_date,
        u2.id AS inviter_id,
        u2.join_date AS inviter_join_date
    FROM users u1
    JOIN users u2
    ON u1.invited_by = u2.id
    ORDER BY 1
),

cycle_times AS (    
    SELECT
        *,
        invited_join_date - inviter_join_date AS cycle_time
    FROM join_dates
),

cycle_months AS (
    SELECT 
        *, 
        EXTRACT(month FROM inviter_join_date) AS month
    FROM cycle_times
)

SELECT 
    month, 
    CAST(avg(cycle_time) AS float) AS avg_cycle_time 
FROM cycle_months
GROUP BY 1
ORDER BY 1

 * postgresql://fknight:***@localhost/postgres
3 rows affected.

[(Decimal('1'), 27.0), (Decimal('2'), 12.5), (Decimal('3'), 3.0)]